projects/rarefied-flows/impingment/sims/templates/compressible/rhoSimpleFoam/squareBendLiq/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|e|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-7;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      1.5;

    transonic       no;
    consistent      no;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon|e|h)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        e               0.7;
        k               0.7;
        epsilon         0.7;
    }
}

// ************************************************************************* //
